paper
describes
natural
language
based
expert
system
public
available
com
web
server
since
beginning
bilingual
relying
internal
independent
logic
representation
using
examples
mt
czech
russian
morphological
disambiguation
argue
really
close
languages
possible
obtain
better
translation
quality
means
methods
problem
group
similar
also
discussed
major
construction
tic
model
lack
large
parallel
cor
first
describe
text
mining
finds
texts
automatically
generated
corpus
used
train
probabilistic
translates
queries
crosslanguage
information
retrieval
discuss
problems
training
show
preliminary
results
provides
customer
service
allowing
users
retrieve
identification
numbers
parts
systems
spoken
dialogue
presents
evaluation
shows
successfully
approximately
proposes
way
improve
trans
lation
participants
easily
obtained
side
component
roles
transfer
rules
dictionary
entries
experiment
unseen
dia
demonstrated
recall
sion
showed
method
effective
key
technology
enabling
con
report
corpora
rewriting
dialogues
type
would
occur
one
computer
instead
human
complement
present
guidelines
illustrate
three
approaches
different
development
implemented
framework
developing
monolingual
multilingual
generation
applications
machine
demonstrates
uniform
approach
declarative
transformations
dependency
structures
syntactic
conceptual
levels
processing
practical
learned
making
air
travel
plans
telephone
fully
conversational
allows
user
specify
constraints
plan
arbitrary
order
ask
questions
etc
general
english
operates
according
agenda
mechanism
rather
finite
state
network
attempts
reports
largescale
end
relation
event
extraction
extracts
total
types
relations
events
represents
much
wider
coverage
typical
consists
specialized
tagging
modules
co
reference
resolution
module
template
quantitative
analyze
detail
future
abstract
explores
identifying
sen
tence
boundaries
transcriptions
produced
automatic
speech
recognition
ment
determines
level
perform
task
described
well
memory
computational
addresses
asr
unusual
field
generally
commonly
nlp
versions
highly
documents
articles
however
many
example
concentrate
output
differ
sort
normally
number
ways
single
case
usually
upper
may
contain
tion
figure
compares
short
format
version
includes
remainder
error
free
shall
referred
standard
situations
required
process
obvious
survey
incorrect
make
difficult
answer
question
correctly
detect
useful
tool
performs
local
characteristics
determine
whether
javox
spokenlanguage
existing
desktop
architecture
al
programs
modification
use
ap
compiled
code
grammars
grammar
mat
additional
semantic
ing
realworld
overview
set
tools
software
developers
requires
changes
source
modifying
program
intended
provide
functionality
associated
mouse
actions
graphical
interfaces
completely
develop
interface
whatever
several
previous
focused
building
et
goal
traditional
goals
project
speed
mixed
tive
time
improves
upon
two
employs
strategy
adaptation
adapt
response
strategies
effect
extracted
utterances
second
management
processes
providing
devel
behavior
forms
successive
tions
linguistic
domain
knowledge
step
produces
describing
transformation
simple
fi
result
per
treatment
tasks
resolving
pronouns
correcting
past
lot
work
linguistics
directed
finding
exploit
ever
increasing
volume
electronic
efforts
allowed
substantial
expansion
makes
new
potential
errors
rank
sus
answers
query
technique
annotation
ments
phrases
labels
certain
kinds
given
ir
sys
tem
returns
matching
passages
linear
function
seven
variables
techniques
trec
qa
discusses
ie
textract
nl
answering
role
application
named
entity
important
ii
shallow
parser
structural
basis
iii
highlevel
evaluate
combines
adhoc
summa
analysis
series
experiments
examine
statistical
questionanswering
find
word
computed
vector
space
quickly
accurately
relevant
summarization
small
increases
performance
limits
filters
focus
even
offer
improvements
purely
especially
integrated
compound
noun
crucial
prob
korean
nouns
appear
without
real
identify
constituents
tation
lexical
data
segmentation
done
steps
manually
constructed
whose
million
algo
rithm
proposed
frequencies
tabular
parsing
operation
accuracy
turns
sentence
original
twostage
passed
whenever
pruned
return
parse
see
simulated
measure
gram
mar
takes
account
contribution
sentences
tences
experimental
summarized
table
part
refers
french
lower
lan
guage
line
gathered
comparison
figures
pruning
whole
testing
disjuncts
corresponding
respectively
course
statistics
maximum
crossvalidation
retained
algorithm
specifically
identified
sets
outline
attribute
value
enough
accept
constrained
greatly
tightly
constrain
understanding
higher
mainly
tokenization
although
achieving
precise
introduce
concept
intermediate
units
characters
resolve
analyzer
hybrid
ne
entropy
hidden
markov
hmm
grammatical
strengths
weaknesses
combination
high
precision
tagger
external
carried
de
spelling
addressing
particular
issue
form
combined
er
detection
correction
contextdependent
developed
aim
dealing
frequent
found
collected
projects
constructions
intelligence
provided
yet
keep
robust
efficient
thus
superior
ability
deal
context
dependent
access
relevance
passage
unlike
combine
benefit
controlled
vocabulary
indexing
currently
almost
topics
applies
news
topic
definitions
built
substantially
automated
engineering
pattern
adapting
scenario
entails
expensive
patterns
au
starting
initial
incremental
procedure
evaluations
resulting
establish
categorized
lists
names
annotated
stateoftheart
en
filtering
acquired
benefits
achieved
scores
test
baseline
sophisticated
supervised
learning
measured
typically
retrieving
smaller
section
namely
direct
smart
extract
ranked
matches
frequency
position
evaluated
track
give
significant
concepts
compare
extracting
index
terms
content
criteria
alone
technical
term
highest
rating
cover
age
metric
head
outperforms
keyword
novel
reduction
removing
extraneous
document
purpose
uses
multiple
sources
decide
removed
including
written
sum
motivation
current
rely
produce
summaries
pro
often
reuse
input
generate
simply
together
humans
edit
summary
coherent
six
editing
combining
reduced
sub
specific
descriptions
call
operations
material
prepositional
phrase
name
variety
character
explore
effects
rate
amount
outofvocabulary
loss
punctuation
usefulness
usage
redundant
likely
causes
overgeneration
less
half
german
actually
tested
methodology
applied
seen
writing
implementation
aspects
theory
main
concerns
models
ground
discourse
move
engine
assumes
ts
informa
states
subject
various
updating
mechanisms
corpusbased
require
words
occurred
similarity
translations
thesaurus
seems
reached
full
rich
still
open
far
satisfactory
exponential
five
focuses
sparseness
extensive
conclusion
strongly
preferred
choice
circumstances
pos
widely
recent
followed
others
neural
networks
decision
trees
select
tests
unfortunately
im
complicated
agreement
variation
categories
either
ex
plural
cases
expressed
exceptions
therefore
tags
se
impact
constraint
cdg
conventional
improvement
expanding
templates
us
minor
background
integrate
importance
investigated
community
become
increasingly
recognizers
dialog
zue
ngram
stochastic
power
limited
regular
recognizer
build
ac
act
interaction
signal
must
mapped
repre
obtaining
utterance
degree
utility
mapping
correctness
interpretation
eg
expressions
believe
gained
domains
complex
research
supported
national
science
mod
advantages
dis
harper
contextfree
acoustic
matched
fairly
becomes
powerful
rec
furthermore
independently
clearly
adds
flexibility
wide
tried
include
construct
prototype
integrates
domainspecific
speaker
rapidly
coefficients
differences
feature
frame
parameter
mixture
distributions
em
viterbi
lattice
contains
alternative
sounds
probabilities
formation
compressed
graph
acts
begins
identical
nodes
exactly
preceding
following
edge
probability
adjacent
paths
eliminating
adding
graphs
increase
compared
parses
best
consistent
acoustics
ity
supports
hypotheses
hence
capable
representing
control
directly
relationships
create
pre
consider
sense
next
top
hypothesis
selection
unsupervised
negative
evidence
textual
responses
foreign
conditional
unificationbased
auxiliary
estimated
incorporate
selectional
unification
functional
applicable
categorial
hpsg
empirical
assessment
bidirectional
typed
demonstrate
subsumption
average
complexity
bottomup
chart
implementations
ambiguity
inherent
segments
string
analysed
object
recorded
treat
analyses
otherwise
computation
theoretically
items
maintaining
pointers
association
item
termed
structure
cf
represent
objects
atomic
category
symbols
able
final
every
distinct
valid
tree
derived
abstracts
statistically
identifies
aligned
containing
due
comparative
ranking
relative
initiative
conducted
analyzed
along
factors
features
distribution
led
efficiency
efficiently
resolved
resulted
overall
arise
predict
problematic
help
allow
manager
modify
perhaps
classifier
significantly
base
trained
exchange
know
correct
change
prosodic
confidence
score
indicating
incorrectly
recognized
learn
showing
versus
algorithms
treebank
lexicalized
elements
regarding
cfgs
lefttoright
fashion
left
recursion
lead
known
transforms
cfg
equivalent
non
compact
practice
boundary
partofspeech
necessary
tag
proper
handling
made
formal
parsers
cannot
within
acceptable
called
property
relatively
people
designed
subjects
least
nearly
extensively
central
instance
particularly
morphology
involves
copying
phonological
finitestate
representations
via
implement
proposal
variant
automata
existence
finally
presented
notions
aimed
article
environment
linguists
disambiguate
among
wordnet
synsets
judgements
suggests
promise
constructing
ad
reasoning
capabilities
addition
basic
pa
issues
actual
concerning
design
online
fundamental
university
services
ta
bases
attention
later
functions
adopted
directions
analyzing
military
messages
fact
statements
belief
parameters
accounts
range
message
years
effort
operating
company
inc
creation
electronically
objective
capability
largely
manual
derive
devoted
primarily
interactive
formats
majority
concentrated
naval
presence
database
missing
increased
organization
economic
databases
remains
entry
already
restricted
discussion
description
sections
papers
literature
naturallanguage
operational
ran
times
faster
serial
support
searching
accessed
search
assistance
gap
authors
lexicon
merging
dic
multivoc
product
ordinary
generates
realtime
divided
prosody
frames
view
world
presentation
industrial
commercial
generating
coding
complete
aims
package
advanced
tailor
static
configuration
facility
requests
occurring
stories
bottom
four
interact
flexible
manner
facilitates
exploration
implicit
relationship
taken
properly
semantically
related
senses
believed
constitute
rulebased
translate
fixed
processed
andor
handle
kind
examplebased
plays
japanese
transla
equivalents
propose
semiautomatic
might
helps
professional
translators
alignment
candidate
hard
filter
emphasize
completeness
native
miss
reduce
burden
phase
candidates
convenient
business
terminology
technologies
taggers
synthesis
places
brown
ibm
address
dept
bar
suggest
could
extremely
want
menu
translated
manuals
author
reader
target
num
ber
consistency
ensure
list
read
coordinate
conjunctions
selecting
formed
individual
conjunction
determining
write
scope
taking
advantage
symmetric
balance
cost
incorporated
knowledgebased
xerox
sample
previously
achieve
encountered
evaluating
assign
early
tagged
recently
minimal
priori
needed
ei
transition
good
ultimately
reduces
improving
pus
heuristics
conclusions
greater
assigning
defined
collections
follows
giving
regard
probable
sequence
fb
assigns
chosen
ones
competing
gain
introduction
employ
reach
optimal
take
long
distance
dependencies
difficulty
broad
similarities
working
simultaneously
engines
collect
possibly
incomplete
joint
integrating
ebmt
idea
na
processors
accurate
tdmt
utilizing
effectively
put
expression
study
concluded
need
moreover
size
requirements
scale
strong
supporting
composed
terminological
purposes
great
stress
placed
variations
metarules
relate
morphosyntactic
variants
documentation
center
accounting
straightforward
extended
acquisition
growing
common
needs
creating
instructions
tends
understood
person
activity
kb
encoding
loom
location
fall
fog
marine
weather
forecasts
reflect
style
sublanguages
semantics
generator
entered
percent
roughly
graphics
workstation
rule
thought
verbal
fit
experience
shown
posed
low
commandtalk
inter
face
forces
measures
execution
simulation
separate
components
agent
ar
sites
demonstration
principal
let
voice
command
points
lines
map
display
begin
clause
window
net
prove
reported
earlier
facilitate
vs
yield
tech
note
go
multimodal
integration
venture
planning
gui
sought
pointing
inputs
bbn
valad
logistics
experts
displayed
appears
appropriate
choose
keyboard
clicks
runs
darpa
agency
applicability
realistic
va
environments
routine
easy
feasibility
illustrates
tokens
lexicosemantic
sharing
portions
across
share
assumed
architectures
interested
designing
linguistically
motivated
resources
theoretical
perspective
family
oriented
array
systematic
syntactical
primitive
entities
ontology
serve
shared
looks
cm
metrics
notion
outputs
indicate
consistently
unknown
compatible
class
transducers
modeling
classical
capture
considered
sent
define
winch
improved
perplexity
bias
favor
shorter
derivations
wrong
elementary
derivation
atis
wall
street
journal
gains
factor
clustering
prior
created
effectiveness
scheme
tables
heuristic
employed
fmeasure
attributevalue
structured
hierarchy
verb
pairs
away
wellknown
performed
art
frameworks
preference
regularities
respect
arguments
indirect
pilot
think
tend
simplicity
like
thank
laboratory
library
classes
nsf
something
stage
entirely
relies
values
refinement
tins
point
reasonably
boolean
enhancement
areas
avoiding
solely
separated
consideration
verbs
involving
computing
interpretations
production
specification
canonical
productions
specifications
last
advances
interest
area
participated
tipster
muc
quite
successful
newswire
filling
eventually
replaced
implications
dynamic
adjectives
indicators
coded
stored
induction
pronunciation
apply
dutch
qualitatively
conclude
whereas
classificationbased
interpreted
leftcorner
removes
topdown
larger
scoring
pieces
inside
difference
transliteration
alphabet
extending
correlation
exploring
explain
ek
phenomena
phoneme
chunks
length
limit
applying
reliability
subclass
lfg
strings
obviously
formalisms
desired
established
beyond
sequences
properties
samples
informative
syntactically
categorization
classify
works
labeled
overcome
difficulties
confirmation
recognize
plausible
confident
estimate
contexts
simplified
smoothing
weights
organized
around
collection
choices
challenges
weighted
ed
counting
ambiguous
modelling
promising
choosing
solution
morphemes
idioms
discontinuous
treated
depending
turned
fast
hi
detected
specified
composition
amounts
satisfaction
chunking
learnt
bigram
inference
np
programming
calculating
refer
gives
correspondences
extension
towards
linked
pair
rewrite
verbmobil
contextual
spontaneous
post
tries
achieves
precisionrecall
parsed
label
di
investigate
incorporating
richer
constituent
tense
translating
aspect
determination
temporal
adverbial
running
involved
always
contrast
education
grant
iv
lexicons
robustness
unrestricted
chunk
criterion
yielded
formalism
characterized
characterize
doubt
nature
subsequent
appropriately
frequently
another
comparable
significance
feedback
restrict
ordering
restriction
looking
repairs
chinese
immediate
phrasal
creates
suitable
proved
ending
global
consisting
crossdocument
replace
concrete
essentially
quantities
discovered
represented
introduces
solutions
embedded
conversations
spanish
rapid
european
arc
attempt
fill
normal
lemma
indicated
attributes
markup
syntax
link
procedures
included
ca
primary
percentage
scientific
representative
modern
principles
formulated
add
meet
interchange
introducing
adequate
encoded
splitting
special
element
optional
id
unique
identifier
store
normalized
expected
semi
submitted
editor
stred
annotations
depends
offers
linguist
look
mode
mark
clear
fig
operator
windows
right
arcs
fields
except
status
ai
ct
eli
db
vi
adv
root
ci
brings
mentioned
links
binary
groups
corresponds
latter
interesting
omitted
introduced
bought
phantom
node
inserted
wordform
plus
slightly
modified
vast
count
readers
predicate
book
quantity
pages
come
clauses
unit
analytical
covered
diagrams
devices
competence
formula
instances
meetings
date
back
enhance
idiomatic
reasonable
checker
webbased
third
un
distributed
configurations
try
classified
partially
little
underlying
sufficiently
align
refined
play
labor
get
committee
started
japan
persons
locations
definition
soon
scored
corrections
decides
poor
hierarchical
convert
completed
addressed
accessing
supplied
necessity
surface
inferences
instantiated
enables
turn
deep
sound
equivalences
correspondence
weighting
retrieved
utilizes
clusters
weight
ratio
differs
secondary
mean
typology
numerical
considerable
attached
keywords
match
formulation
briefly
modes
communication
true
interactively
raises
core
logical
fragments
righttoleft
decoding
direction
partial
observed
machines
challenge
equations
calculated
illformed
phenomenon
limitations
assigned
uncertainty
indicates
possibility
speakers
rates
investigation
pertinent
hand
comparing
active
cards
period
tracking
starts
implicitly
ambiguities
topranked
smallscale
compile
compositional
stated
concern
phonetic
sometimes
meanings
cause
predefined
verify
knn
critical
reliable
situation
explicit
scenarios
insights
investigating
dictionaries
eight
considers
title
wording
titles
consensus
compute
observation
respond
understand
imposes
classification
guided
adjoining
feasible
subset
covering
analogous
vocabularies
studies
desirable
sensitive
contextsensitive
hardware
review
restrictions
reasons
views
transformational
considerations
looked
permits
assume
storage
inputoutput
say
correspond
suppose
changing
day
contents
returned
assumption
assuming
anything
examination
stating
phrasestructure
mechanical
psg
suggested
pushdown
sufficient
dc
examined
routines
john
changed
ordered
concerned
avoid
unambiguous
affect
wish
marks
raised
physical
guide
conditions
considering
expect
matter
reading
comprehension
paragraph
references
meaning
evaluators
inappropriate
printed
reflecting
comments
opinions
customers
personal
received
remaining
rejected
brief
late
inclusion
meant
immediately
though
thing
essential
lost
never
worth
feel
justification
contained
details
occurrence
governed
nominal
disadvantage
expanded
extent
bound
proportion
nps
occurs
helped
longer
idiom
inadequate
considerably
adjective
things
met
said
implied
stem
accepted
prefix
prefixes
became
easier
got
indeed
forward
evident
translator
vertical
preparation
lookup
organize
suffix
cd
ri
cc
ti
las
suffixes
gave
fewer
split
determined
tape
minutes
recognizes
column
equation
continuous
ignored
sorted
augmented
sorts
originally
attempting
coupled
despite
recognised
place
extend
closely
conference
express
operate
succession
passes
stop
pass
terminal
member
connected
coordinating
setting
aid
mb
marked
former
ia
explicitly
la
fifth
sixth
check
pronoun
unified
appendix
descriptive
ease
basically
predicates
conversion
tn
denotes
viewed
lisp
outlines
country
flow
requiring
aids
solving
principle
distinctive
inferencing
possibilities
computers
react
serious
constitutes
option
interactions
reflected
monitor
producing
si
follow
argument
artificial
ideas
quantifier
lesser
neither
interpreting
intelligent
institute
operators
subsets
empty
hope
formulate
depth
apparent
exist
answered
selected
denote
realized
ultimate
sr
referring
compatibility
elaboration
writers
behaviour
writer
mary
likes
interlingual
cross
distinctions
ported
grows
acquiring
performing
ideally
customization
conflicts
rough
failure
failures
explained
enable
maintain
guess
handled
fragment
segment
illustrated
break
il
outlined
emphasis
sign
stages
rumors
inflexion
pc
dos
simplest
government
accepts
specifying
nbest
body
office
guessing
compression
arabic
yields
decomposition
noise
rest
studying
began
kept
took
fa
nil
concatenation
le
universal
optimization
checking
reflects
defining
deterministic
automaton
generalized
generalization
parentheses
focussed
extends
capturing
success
individuals
meeting
cognitive
explanation
knowing
asked
frisco
record
knows
judge
told
tell
expertise
symbol
session
clues
exception
bayesian
influence
interpret
posterior
records
tower
probably
department
locationfrisco
dont
revised
exact
approximate
contribute
update
says
asks
detailed
random
variable
impossible
reason
formally
goes
parent
false
deeper
drawn
request
trace
skill
speaking
mental
interval
pmt
run
appeared
implies
agreed
leaving
heavy
adapted
functioning
facts
communicative
solved
initiated
international
conferences
added
force
distinguished
interacting
trying
partners
schemes
studied
start
cooperative
opposed
agree
participating
processor
isolated
availability
experiences
near
researchers
computations
unless
multilevel
clarification
toward
relating
stack
shadow
file
entire
decisions
worked
transcription
usual
yes
alternatives
anaphora
solve
expressive
viewing
cambridge
gazdar
inheritance
encode
thematic
precedence
legal
binding
inherits
edges
exists
anaphoric
throughout
coreference
definite
proceeds
reversible
requirement
progress
accomplished
gpsg
referent
functor
slots
establishing
failing
action
inefficiency
identity
fare
consequence
workshop
examining
assumptions
judgement
collecting
judged
materials
nonetheless
slow
minimum
insight
substructures
irrelevant
equally
president
repeated
combinations
displays
fits
internet
companies
transitions
talk
handcoded
ongoing
vectors
recognizing
acronym
focusing
suited
fluent
fp
foot
pw
onto
assignment
heavily
mind
developments
paradigm
popperian
chomskyan
rationalism
resultant
history
modifications
welldefined
nothing
consequently
approximation
incorporates
seem
joshi
smith
none
saying
law
barrier
misses
valuable
death
reducing
lob
virtually
approached
understandable
enabled
hobbs
careful
bring
going
sure
glp
extensions
initially
carry
outside
extreme
potentially
token
contract
necessarily
official
helpful
responsible
objectoriented
consist
atn
generalised
attempted
gpsgs
old
vp
lp
trivial
featurevalue
specifies
captured
metarule
passive
inherited
copied
atns
positions
expand
shieber
recogniser
extra
comparisons
det
adj
adjust
path
explored
contributed
singular
cues
preferable
bank
structuring
forming
thereby
pauses
prepared
ucg
phonology
notation
portion
te
nominals
indicative
aime
marie
backward
hf
sf
prolog
frontend
skilled
minimally
maximal
variability
merged
condition
tenses
constraining
products
demo
microphone
opportunity
talker
year
nonlinear
region
arrays
beam
gather
maximize
measuring
carnegie
mellon
dragon
speakerindependent
sphinx
highperformance
accomplishments
voyager
summit
tina
csr
sls
collaboration
speakerdependent
resource
flight
continued
february
auditory
completion
cv
abilities
objectives
preprocessor
noisy
transmission
assess
cmu
mit
sri
sris
board
humanmachine
airline
site
contractors
cycle
synchronous
apsg
computationally
reject
integer
push
schabes
david
moves
substitution
locality
hates
george
broccoli
cooked
violently
similarly
light
apparently
strict
iclone
mappings
exhaustive
disjunctive
satisfied
disjunction
negation
penman
satisfy
transclause
portability
somewhat
sponsored
united
defense
sun
begun
su
meaningful
nist
june
queryresponse
consisted
counts
unanswerable
diagnoses
flights
denver
july
flt
atl
den
san
francisco
continental
fares
pundit
synchronization
cas
unisys
tuples
el
moving
subjective
black
box
failed
protocol
comparator
waveform
ref
hyp
judges
codes
hoc
pointer
buffers
equal
ten
calls
cn
zz
cl
ul
li
cu
pi
cr
cg
vd
ui
tf
tr
eu
az
pm
mo
delphi
harc
blind
filled
airports
phoenix
phone
nonverbal
pronunciations
slot
dates
sql
del
population
oag
rejection
ingres
cities
nine
massachusetts
qtip
idi
rela
idil
optimized
zero
directionassistance
delta
rarely
cityl
transportation
worse
alarm
separately
variance
growth
noted
usability
curve
measurement
talkers
surprising
restaurants
served
wordpair
passing
matrix
plotted
hp
reviewed
host
measurements
fills
curves
utilized
batch
finder
standardized
seconds
modular
alarms
assessing
judgments
stream
span
resolves
months
geographic
room
esps
updates
docu
datasets
terrorism
dry
ventures
microelectronics
fabrication
month
sgml
york
enamex
organizations
threshold
closer
analysts
ejv
jjv
eme
jme
jv
keys
spurious
mmr
generic
camp
doc
partwhole
headline
ument
chain
chains
assessors
disagreement
ranks
smiths
sentenceextractor
vsmdisambiguate
perry
golf
alg
fusion
matchers
querydocument
sfc
lsi
aggressive
dimension
queryspecific
dimensions
attributed
fastus
fastspec
cia
cgi
noncommittal
agencies
byte
xset
nth
objectreference
persistent
attributedobject
persistentobject
bytesequence
externalid
rawdata
annotationset
copy
firstdocument
spans
mexico
que
handtranslated
mexicana
highfrequency
ep
infoseek
mundial
checoslovaquia
nacional
egipto
finlandia
unidas
una
republica
sobre
los
filipinas
colombia
documento
argentina
pafses
contries
mexicano
transportability
gecmu
nmsubrandeis
umasshughes
languagedomain
shogun
nontipster
saic
recallprecision
undergeneration
shortfall
jointventure
entityrelationship
twopart
slotfill
terrorist
nonrelevant
harder
setfill
coretemplate
fulltemplate
unfilled
credit
noncore
placename
nancy
chinchor
sundheim
analyst
codings